nxp-mcuxpresso/mcux-soc-svd/KW47Z42082/KW47Z42082.xml
        <register>
          <name>IE</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FWMIE0</name>
              <description>FIFO 0 Watermark Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOFIE0</name>
              <description>Result FIFO 0 Overflow Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FWMIE1</name>
              <description>FIFO1 Watermark Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOFIE1</name>
              <description>Result FIFO1 Overflow Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEXC_IE</name>
              <description>Trigger Exception Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCOMP_IE</name>
              <description>Trigger Completion Interrupt Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>All disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER_0_COMPLETE_ENABLED</name>
                  <description>Trigger completion interrupts are enabled for trigger source 0 only.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER_1_COMPLETE_ENABLED</name>
                  <description>Trigger completion interrupts are enabled for trigger source 1 only.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER_x_COMPLETE_ENABLED_3</name>
                  <description>Associated trigger completion interrupts are enabled.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER_x_COMPLETE_ENABLED_4</name>
                  <description>Associated trigger completion interrupts are enabled.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER_x_COMPLETE_ENABLED_5</name>
                  <description>Associated trigger completion interrupts are enabled.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER_x_COMPLETE_ENABLED_6</name>
                  <description>Associated trigger completion interrupts are enabled.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER_x_COMPLETE_ENABLED_7</name>
                  <description>Associated trigger completion interrupts are enabled.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER_x_COMPLETE_ENABLED_8</name>
                  <description>Associated trigger completion interrupts are enabled.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER_x_COMPLETE_ENABLED_9</name>
                  <description>Associated trigger completion interrupts are enabled.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER_x_COMPLETE_ENABLED_10</name>
                  <description>Associated trigger completion interrupts are enabled.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER_x_COMPLETE_ENABLED_11</name>
                  <description>Associated trigger completion interrupts are enabled.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER_x_COMPLETE_ENABLED_12</name>
                  <description>Associated trigger completion interrupts are enabled.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER_x_COMPLETE_ENABLED_13</name>
                  <description>Associated trigger completion interrupts are enabled.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER_x_COMPLETE_ENABLED_14</name>
                  <description>Associated trigger completion interrupts are enabled.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_TRIGGER_COMPLETES_ENABLED</name>
                  <description>All enabled</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DE</name>
          <description>DMA Enable Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FWMDE0</name>
              <description>FIFO 0 Watermark DMA Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FWMDE1</name>
              <description>FIFO1 Watermark DMA Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>Configuration Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x800000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TPRICTRL</name>
              <description>ADC Trigger Priority Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABORT_CURRENT_ON_PRIORITY</name>
                  <description>Current conversion is aborted and the new command specified by the trigger is started.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FINISH_CURRENT_ON_PRIORITY</name>
                  <description>Current command is stopped after completing the current conversion. If averaging is enabled, the averaging loop is completed. CMDHn[LOOP] is ignored and the higher-priority trigger is serviced.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FINISH_SEQUENCE_ON_PRIORITY</name>
                  <description>Current command is completed (averaging, looping, compare) before servicing the higher-priority trigger.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSEL</name>
              <description>Power Configuration Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOWEST</name>
                  <description>Lowest power</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERMEDIATE_1</name>
                  <description>Higher power than 00b</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERMEDIATE_2</name>
                  <description>Higher power than 01b</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGHEST</name>
                  <description>Highest power</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFSEL</name>
              <description>Voltage Reference Selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPTION_1</name>
                  <description>Option 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPTION_2</name>
                  <description>Option 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPTION_3</name>
                  <description>Option 3</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRES</name>
              <description>Trigger Resume Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Not automatically resumed or restarted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Automatically resumed or restarted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCMDRES</name>
              <description>Trigger Command Resume</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Trigger sequence automatically restarted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Trigger sequence resumed from the command that was executed prior to the exception.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPT_EXDI</name>
              <description>High-Priority Trigger Exception Disable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUDLY</name>
              <description>Power-up Delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWREN</name>
              <description>ADC Analog Pre-Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_PRE_ENABLED</name>
                  <description>ADC analog circuits are only enabled while conversions are active. Analog startup delays affect performance.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRE_ENABLED</name>
                  <description>ADC analog circuits are pre-enabled and ready to execute conversions without startup delays, at the cost of higher DC current consumption. A single power-up delay (CFG[PUDLY]) is executed immediately once PWREN is set. No detected triggers begin ADC operation until the power-up delay time has passed. After this initial delay expires, the analog circuits remain pre-enabled, and no additional delays are executed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PAUSE</name>
          <description>Pause Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PAUSEDLY</name>
              <description>Pause Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAUSEEN</name>
              <description>Pause Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWTRIG</name>
          <description>Software Trigger Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWT0</name>
              <description>Software Trigger 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TRIGGER</name>
                  <description>No trigger 0 event generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INITIATE_TRIGGER_0</name>
                  <description>Trigger 0 event generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWT1</name>
              <description>Software Trigger 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TRIGGER</name>
                  <description>No trigger 1 event generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INITIATE_TRIGGER_1</name>
                  <description>Trigger 1 event generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWT2</name>
              <description>Software Trigger 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TRIGGER</name>
                  <description>No trigger 2 event generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INITIATE_TRIGGER_2</name>
                  <description>Trigger 2 event generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWT3</name>
              <description>Software Trigger 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TRIGGER</name>
                  <description>No trigger 3 event generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INITIATE_TRIGGER_3</name>
                  <description>Trigger 3 event generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
